// Validation errors messages for Parsley
// Load this after Parsley

Parsley.addMessages('ka', {
  defaultMessage: "მნიშვნელობა არასწორია.",
  type: {
    email:        "შეიყვანეთ ელ-ფოსტის მისამართი.",
    url:          "შეიყვანეთ URL მისამართი.",
    number:       "შეიყვანეთ რიცხვი.",
    integer:      "შეიყვანეთ მთელი რიცხვი.",
    digits:       "შეიყვანეთ მხოლოდ ციფრები.",
    alphanum:     "შეიყვანეთ ასო-ციფრული მნიშვნელობა."
  },
  notblank:       "ეს ველი არ უნდა იყოს ცარიელი.",
  required:       "სავალდებულო ველი.",
  pattern:        "ეს მნიშვნელობა არასწორია.",
  min:            "ეს მნიშვნელობა უნდა იყოს არანაკლებ %s.",
  max:            "ეს მნიშვნელობა უნდა იყოს არაუმეტეს %s.",
  range:          "ეს მნიშვნელობა უნდა იყოს %s-დან %s-მდე.",
  minlength:      "ეს მნიშვნელობა უნდა შეიცავდეს მინიმუმ %s სიმბოლოს.",
  maxlength:      "ეს მნიშვნელობა უნდა შეიცავდეს მაქსიმუმ %s სიმბოლოს.",
  length:         "ეს მნიშვნელობა უნდა შეიცავდეს %s-დან %s სიმბოლომდე.",
  mincheck:       "აირჩიეთ მინიმუმ %s მნიშვნელობა.",
  maxcheck:       "აირჩიეთ მაქსიმუმ %s მნიშვნელობა.",
  check:          "აირჩიეთ %s-დან %s მნიშვნელობამდე.",
  equalto:        "ეს მნიშვნელობა უნდა ემთხვეოდეს."
});

Parsley.setLocale('ka');
